frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/Device/Geehy/APM32L0xx/Include/apm32l0xx.h
/*!
 * @file        apm32l0xx.h
 *
 * @brief       CMSIS Cortex-M0 Device Peripheral Access Layer Header File.
 *
 * @details     This file contains all the peripheral register's definitions, bits definitions and memory mapping
 *
 * @version     V1.0.0
 *
 * @date        2021-12-25
 *
 * @attention
 *
 *  Copyright (C) 2020-2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#ifndef __APM32L0xx_H
#define __APM32L0xx_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/** @addtogroup Library_configuration_section
  * @{
  */

/** @addtogroup CMSIS_Device Device Definitions for CMSIS
  @{
 */

/**
 * @brief Define Value of the External oscillator in Hz
 */
#ifndef  HSE_VALUE
#define  HSE_VALUE             ((uint32_t)8000000)
#endif

/** Time out for HSE start up */
#define HSE_STARTUP_TIMEOUT    ((uint32_t)0x0500)

/** Time out for HSI start up */
#define HSI_STARTUP_TIMEOUT    ((uint32_t)0x0500)

/** Value of the Internal oscillator in Hz */
#define HSI16_VALUE            ((uint32_t)16000000)
#define HSI48_VALUE            ((uint32_t)48000000)

#define LSE_VALUE              ((uint32_t)32768)
#define LSI_VALUE              ((uint32_t)37000)
#define MSI_VALUE              ((uint32_t)2097152) /*!< 32.768 kHz * 2^6 */

/*!< [31:16] APM32L0XX Standard Peripheral Library main version V1.0.0*/
#define __APM32L0_DEVICE_VERSION_MAIN   (0x01) /*!< [31:24] main version */
#define __APM32L0_DEVICE_VERSION_SUB1   (0x05) /*!< [23:16] sub1 version */
#define __APM32L0_DEVICE_VERSION_SUB2   (0x00) /*!< [15:8]  sub2 version */
#define __APM32L0_DEVICE_VERSION_RC     (0x00) /*!< [7:0]  release candidate */
#define __APM32L0_DEVICE_VERSION        ((__APM32L0_DEVICE_VERSION_MAIN << 24)\
                                        |(__APM32L0_DEVICE_VERSION_SUB1 << 16)\
                                        |(__APM32L0_DEVICE_VERSION_SUB2 << 8 )\
                                        |(__APM32L0_DEVICE_VERSION_RC))

/** Core Revision r0p1  */
#define __CM0PLUS_REV             0
/** APM32L0xx do not provide MPU  */
#define __MPU_PRESENT             1
/** APM32L0xx uses 2 Bits for the Priority Levels */
#define __NVIC_PRIO_BITS          2
/** Set to 1 if different SysTick Config is used */
#define __Vendor_SysTickConfig    0
/** Set to 1 if different Vector Table Offset is used */
#define __VTOR_PRESENT            1

#if defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050) /* ARM Compiler V6 */
  #ifndef __weak
    #define __weak  __attribute__((weak))
  #endif
  #ifndef __packed
    #define __packed  __attribute__((packed))
  #endif
#elif defined ( __GNUC__ ) && !defined (__CC_ARM) /* GNU Compiler */
  #ifndef __weak
    #define __weak   __attribute__((weak))
  #endif /* __weak */
  #ifndef __packed
    #define __packed __attribute__((__packed__))
  #endif /* __packed */
#endif /* __GNUC__ */

/**
 * @brief    Interrupt Number Definition
 */
typedef enum
{
    /**  Cortex-M0 Processor Exceptions Numbers */
    NonMaskableInt_IRQn         = -14,    //!< 2 Non Maskable Interrupt
    HardFault_IRQn              = -13,    //!< 3 Cortex-M0 Hard Fault Interrupt
    SVC_IRQn                    = -5,     //!< 11 Cortex-M0 SV Call Interrupt
    PendSV_IRQn                 = -2,     //!< 14 Cortex-M0 Pend SV Interrupt
    SysTick_IRQn                = -1,     //!< 15 Cortex-M0 System Tick Interrupt

    /**  APM32L0XX specific Interrupt Numbers */
    WWDT_IRQn                   =  0,     //!< Window WatchDog Interrupt
    PVD_IRQn                    =  1,     //!< PVD Interrupt
    RTC_IRQn                    =  2,     //!< RTC Interrupt through EINT Lines 17, 19 and 20
    FLASH_IRQn                  =  3,     //!< Flash global Interrupt
    RCM_CRS_IRQn                =  4,     //!< RCM and CRS global Interrupt
    EINT0_1_IRQn                =  5,     //!< EINT Line 0 and 1 Interrupt
    EINT2_3_IRQn                =  6,     //!< EINT Line 2 and 3 Interrupt
    EINT4_15_IRQn               =  7,     //!< EINT Line 4 to 15 Interrupt
    TSC_IRQn                    =  8,     //!< TSC Interrupt
    DMA_CH1_IRQn                =  9,     //!< DMA Channel 1 Interrupt
    DMA_CH2_3_IRQn              = 10,     //!< DMA Channel 2 and Channel 3 Interrupts
    DMA_CH4_5_6_7_IRQn          = 11,     //!< DMA Channel 4, Channel 5, Channel 6 and Channel 7 Interrupts
    ADC_COMP_IRQn               = 12,     //!< ADC and comparator Interrupt EINT Lines 21, 22
    LPTMR_IRQn                  = 13,     //!< LPTMR Interrupt EINT Lines 29
    USART4_5_IRQn               = 14,     //!< USART4_5 Interrupt
    TMR2_IRQn                   = 15,     //!< TMR2 global Interrupt
    TMR3_IRQn                   = 16,     //!< TMR3 global Interrupt
    TMR6_DAC_IRQn               = 17,     //!< TMR6 and DAC Interrupt
    TMR7_IRQn                   = 18,     //!< TMR7 global Interrupt

    TMR21_IRQn                  = 20,     //!< TMR21 global Interrupt
    I2C3_IRQn                   = 21,     //!< I2C3 Event Interrupt
    TMR22_IRQn                  = 22,     //!< TMR22 global Interrupt
    I2C1_IRQn                   = 23,     //!< I2C1 Event Interrupt
    I2C2_IRQn                   = 24,     //!< I2C2 Event Interrupt
    SPI1_IRQn                   = 25,     //!< SPI1 global Interrupt
    SPI2_IRQn                   = 26,     //!< SPI2 global Interrupt
    USART1_IRQn                 = 27,     //!< USART1 global Interrupt EINT Lines 25
    USART2_IRQn                 = 28,     //!< USART2 global Interrupt EINT Lines 26
    LPUART1_AES_RNG_IRQn        = 29,     //!< LPUART1_AES_RNG Interrupt EINT Lines 28
    LCD_IRQn                    = 30,     //!< LCD Low Priority global Interrupt
    USBD_IRQn                   = 31      //!< USB Low Priority global Interrupt EINT Lines 18
} IRQn_Type;


#include "core_cm0plus.h"     //!< Cortex-M0+ processor and core peripherals
#include "system_apm32l0xx.h" //!< APM32L0xx System Header
#include <stdint.h>

