frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/Device/Geehy/APM32L0xx/Include/apm32l0xx.h
    /** Independent data register */
    union
    {
        __IOM uint32_t INDATA;

        struct
        {
            __IOM uint32_t INDATA     : 8;
            __IM  uint32_t RESERVED1  : 24;
        } INDATA_B;
    } ;

    /** Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
           __OM  uint32_t RST        : 1;
           __IM  uint32_t RESERVED1  : 2;
           __IOM uint32_t POLSEL     : 2;
           __IOM uint32_t REVI       : 2;
           __IOM uint32_t REVO       : 1;
           __IM  uint32_t RESERVED2  : 24;
        } CTRL_B;
    } ;

    __IM  uint32_t  RESERVED;

    union
    {
        __IOM uint32_t INITVAL;

        struct
        {
            __IOM uint32_t VALUE    : 32;
        } INITVAL_B;
    } ;

    union
    {
        __IOM uint32_t POL;

        struct
        {
            __IOM uint32_t PPOL     : 32;
        } POL_B;
    } ;
} CRC_T;

/**
  * @brief CRS registers (CRS)
  */
typedef struct
{
    /** Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t SNINTEN    : 1;
            __IOM uint32_t SWINTEN    : 1;
            __IOM uint32_t EINTEN     : 1;
            __IOM uint32_t ESINTEN    : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t CNTEN      : 1;
            __IOM uint32_t AUTOTRMEN  : 1;
            __IOM uint32_t SWSGNR     : 1;
            __IOM uint32_t HSI48TRM   : 6;
            __IM  uint32_t RESERVED2  : 18;
        } CTRL_B;
    } ;

    union
    {
        __IOM uint32_t CFG;

        struct
        {
            __IOM uint32_t RLDVAL     : 16;
            __IOM uint32_t FELMT      : 8;
            __IOM uint32_t SYNCPSC    : 3;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t SYNCSRCSEL : 2;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t SYNCPOLSEL : 1;
        } CFG_B;
    } ;

    union
    {
        __IM  uint32_t INTSTS;

        struct
        {
            __IM  uint32_t SNFLG      : 1;
            __IM  uint32_t SWFLG      : 1;
            __IM  uint32_t EFLG       : 1;
            __IM  uint32_t ESFLG      : 1;
            __IM  uint32_t RESERVED1  : 4;
            __IM  uint32_t ERRORFLG   : 1;
            __IM  uint32_t SYNCMISS   : 1;
            __IM  uint32_t TRMFLG     : 1;
            __IM  uint32_t RESERVED2  : 4;
            __IM  uint32_t CNTDRCT    : 1;
            __IM  uint32_t FECPT      : 16;
        } INTSTS_B;
    } ;

    union
    {
        __IOM uint32_t INTCLR;

        struct
        {
            __IOM uint32_t SNCLR      : 1;
            __IOM uint32_t SWCLR      : 1;
            __IOM uint32_t ECLR       : 1;
            __IOM uint32_t ESCLR      : 1;
            __IM  uint32_t RESERVED1  : 28;
        } INTCLR_B;
    } ;
} CRS_T;

/**
  * @brief Comparator  (COMP)
  */

typedef struct
{
    /** control and status register */
    union
    {
        __IOM uint32_t COMP1_CSTS;

        struct
        {
            __IOM uint32_t EN1          : 1;
            __IM  uint32_t RESERVED1    : 3;
            __IOM uint32_t INMCCFG1     : 2;
            __IM  uint32_t RESERVED2    : 2;
            __IOM uint32_t WMODESEL1    : 1;
            __IM  uint32_t RESERVED3    : 3;
            __IOM uint32_t LPTMRIN1_1   : 1;
            __IM  uint32_t RESERVED4    : 2;
            __IOM uint32_t POLCFG1      : 1;
            __IM  uint32_t RESERVED5    : 14;
            __IM  uint32_t OUTVAL1      : 1;
            __IOM uint32_t LOCK1        : 1;
        } COMP1_CSTS_B;
    } ;

    /** control and status register */
    union
    {
        __IOM uint32_t COMP2_CSTS;

        struct
        {
            __IOM  uint32_t EN2          : 1;
            __IM   uint32_t RESERVED1    : 2;
            __IOM  uint32_t SPEEDM2      : 1;
            __IOM  uint32_t INMCCFG2     : 3;
            __IM   uint32_t RESERVED2    : 1;
            __IOM  uint32_t INPCCFG2     : 3;
            __IM   uint32_t RESERVED3    : 1;
            __IOM  uint32_t LPTMRIN2_2   : 1;
            __IOM  uint32_t LPTMRIN2_1   : 1;
            __IM   uint32_t RESERVED4    : 1;
            __IOM  uint32_t POLCFG2      : 1;
            __IM   uint32_t RESERVED5    : 14;
            __IM   uint32_t OUTVAL2      : 1;
            __IOM  uint32_t LOCK2        : 1;
        } COMP2_CSTS_B;
    } ;
} COMP_T;

/**
  * @brief Digital-to-Analog converter (DAC)
  */

typedef struct
{
    /** Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t ENCH1      : 1;
            __IOM uint32_t BUFFDCH1   : 1;
            __IOM uint32_t TRGENCH1   : 1;
            __IOM uint32_t TRGSELCH1  : 3;
            __IOM uint32_t WAVENCH1   : 2;
            __IOM uint32_t MAMPSELCH1 : 4;
            __IOM uint32_t DMAENCH1   : 1;
            __IOM uint32_t DMAUDRIEN1 : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t ENCH2      : 1;
            __IOM uint32_t BUFFDCH2   : 1;
            __IOM uint32_t TRGENCH2   : 1;
            __IOM uint32_t TRGSELCH2  : 3;
            __IOM uint32_t WAVENCH2   : 2;
            __IOM uint32_t MAMPSELCH2 : 4;
            __IOM uint32_t DMAENCH2   : 1;
            __IOM uint32_t DMAUDRIEN2 : 1;
            __IM  uint32_t RESERVED2  : 2;
        } CTRL_B;
    } ;

    /** Software trigger register */
    union
    {
        __OM  uint32_t SWTRG;

        struct
        {
            __OM  uint32_t SWTRG1     : 1;
            __OM  uint32_t SWTRG2     : 1;
            __IM  uint32_t RESERVED1  : 30;
        } SWTRG_B;
    } ;

    /** Channel1 12-bit right-aligned data holding register */
    union
    {
        __IOM uint32_t DH12R1;

        struct
        {
            __IOM uint32_t DATA       : 12;
            __IM  uint32_t RESERVED1  : 20;
        } DH12R1_B;
    } ;

    /** Channel1 12-bit left-aligned data holding register */
    union
    {
        __IOM uint32_t DH12L1;

        struct
        {
            __IM  uint32_t RESERVED1  : 4;
            __IOM uint32_t DATA       : 12;
            __IM  uint32_t RESERVED2  : 16;
        } DH12L1_B;
    } ;

