frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/Device/Geehy/APM32L0xx/Include/apm32l0xx.h
    /** FMC power-down key register */
    union
    {
        __OM  uint32_t PDKEY;

        struct
        {
            __OM  uint32_t PDKEY      : 32;
        } PDKEY_B;
    } ;

    /** FMC unlock key register */
    union
    {
        __OM  uint32_t ULKEY;

        struct
        {
            __OM  uint32_t ULKEY      : 32;
        } ULKEY_B;
    } ;

    /** FMC program and erase key register */
    union
    {
        __OM  uint32_t PGESKEY;

        struct
        {
            __OM  uint32_t PGESKEY    : 32;
        } PGESKEY_B;
    } ;

    /** FMC option bytes unlock key register */
    union
    {
        __OM  uint32_t OPTKEY;

        struct
        {
            __OM  uint32_t OPTKEY     : 32;
        } OPTKEY_B;
    } ;

    /** FMC status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM  uint32_t BUSY       : 1;
            __IOM uint32_t EOP        : 1;
            __IM  uint32_t WEHV       : 1;
            __IM  uint32_t RDY        : 1;
            __IM  uint32_t RESERVED1  : 4;
            __IOM uint32_t WPROTERR   : 1;
            __IOM uint32_t PGALGERR   : 1;
            __IOM uint32_t SIZEERR    : 1;
            __IOM uint32_t ERROR      : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t RDPROTERR  : 1;
            __IM  uint32_t RESERVED3  : 2;
            __IOM uint32_t NZERR      : 1;
            __IOM uint32_t WEERR      : 1;
            __IM  uint32_t RESERVED4  : 14;
        } STS_B;
    } ;

    /** FMC option bytes register */
    union
    {
        __IM uint32_t OPT;
        struct
        {
            __IM  uint32_t RPROT      : 8;
            __IM  uint32_t WPROTSEL   : 1;
            __IM  uint32_t RESERVED1  : 7;
            __IM  uint32_t BORLVL     : 4;
            __IM  uint32_t WDTSW      : 1;
            __IOM uint32_t RSTSTOP    : 1;
            __IOM uint32_t RSTSTDB    : 1;
            __IM  uint32_t BOOTB2     : 1;
            __IM  uint32_t RESERVED2  : 7;
            __IM  uint32_t BOOT1      : 1;
        } OPT_B;
    } ;

    /** FMC write protection register 1 */
    union
    {
        __IM uint32_t WPROT1;
        struct
        {
            __IM  uint32_t WPROT1     : 32;
        } WPROT1_B;
    } ;

    __IM  uint32_t  RESERVED1[23];

    /** FMC write protection register 12 */
    union
    {
        __IM uint32_t WPROT2;
        struct
        {
            __IM  uint32_t WPROT2     : 32;
        } WPROT2_B;
    } ;
} FMC_T;

/**
  * @brief Option Bytes Registers
  */
typedef struct
{
    /** Read protection register */
    union
    {
        __IOM uint32_t RDP;

        struct
        {
            __IOM uint32_t RPROT      : 8;
            __IOM uint32_t WPROTSEL   : 1;
            __IOM uint32_t RESERVED1  : 7;
            __IOM uint32_t NRPROT     : 8;
            __IOM uint32_t NWPROTSEL  : 1;
            __IOM uint32_t RESERVED2  : 7;
        }RDP_B;
    };

    /** user register */
    union
    {
        __IOM uint32_t USER;

        struct
        {
            __IOM uint32_t BORLVL     : 4;
            __IOM uint32_t WDTSW      : 1;
            __IOM uint32_t RSTSTOP    : 1;
            __IOM uint32_t RSTSTDB    : 1;
            __IOM uint32_t BOOTB2     : 1;
            __IOM uint32_t RESERVED1  : 7;
            __IOM uint32_t BOOT1      : 1;
            __IOM uint32_t NBORLVL    : 4;
            __IOM uint32_t NWDTSW     : 1;
            __IOM uint32_t NRSTSTOP   : 1;
            __IOM uint32_t NRSTSTDB   : 1;
            __IOM uint32_t NBOOTB2    : 1;
            __IOM uint32_t RESERVED2  : 7;
            __IOM uint32_t NBOOT1     : 1;
        }USER_B;
    };

    /** write protection Bytes 0 and 1 */
    union
    {
        __IOM uint32_t WRP1_1;

        struct
        {
            __IOM uint32_t WPROT1_1      : 16;
            __IOM uint32_t NWPROT1_1     : 16;
        }WRP1_1_B;
    };

    /** write protection Bytes 2 and 3 */
    union
    {
        __IOM uint32_t WRP1_2;

        struct
        {
            __IOM uint32_t WPROT1_2      : 16;
            __IOM uint32_t NWPROT1_2     : 16;
        }WRP1_2_B;
    };

    /** write protection Bytes 4 and 5 */
    union
    {
        __IOM uint32_t WRP2;

        struct
        {
            __IOM uint32_t WPROT2        : 16;
            __IOM uint32_t NWPROT2       : 16;
        }WRP2_B;
    };
} OB_T;

/**
  * @brief General-purpose I/Os (GPIO)
  */
typedef struct
{
    /**GPIO port mode register*/
    union
    {
        __IOM uint32_t MODE;

        struct
        {
            __IOM uint32_t MODE0      : 2;
            __IOM uint32_t MODE1      : 2;
            __IOM uint32_t MODE2      : 2;
            __IOM uint32_t MODE3      : 2;
            __IOM uint32_t MODE4      : 2;
            __IOM uint32_t MODE5      : 2;
            __IOM uint32_t MODE6      : 2;
            __IOM uint32_t MODE7      : 2;
            __IOM uint32_t MODE8      : 2;
            __IOM uint32_t MODE9      : 2;
            __IOM uint32_t MODE10     : 2;
            __IOM uint32_t MODE11     : 2;
            __IOM uint32_t MODE12     : 2;
            __IOM uint32_t MODE13     : 2;
            __IOM uint32_t MODE14     : 2;
            __IOM uint32_t MODE15     : 2;
        } MODE_B;
    } ;

    /**GPIO port output type register*/
    union
    {
        __IOM uint32_t OMODE;

        struct
        {
            __IOM uint32_t OMODE0     : 1;
            __IOM uint32_t OMODE1     : 1;
            __IOM uint32_t OMODE2     : 1;
            __IOM uint32_t OMODE3     : 1;
            __IOM uint32_t OMODE4     : 1;
            __IOM uint32_t OMODE5     : 1;
            __IOM uint32_t OMODE6     : 1;
            __IOM uint32_t OMODE7     : 1;
            __IOM uint32_t OMODE8     : 1;
            __IOM uint32_t OMODE9     : 1;
            __IOM uint32_t OMODE10    : 1;
            __IOM uint32_t OMODE11    : 1;
            __IOM uint32_t OMODE12    : 1;
            __IOM uint32_t OMODE13    : 1;
            __IOM uint32_t OMODE14    : 1;
            __IOM uint32_t OMODE15    : 1;
            __IOM uint32_t RESERVED1  : 16;
        } OMODE_B;
    } ;

    /**GPIO port output speed register*/
    union
    {
        __IOM uint32_t OSSEL;

        struct
        {
            __IOM uint32_t OSSEL0     : 2;
            __IOM uint32_t OSSEL1     : 2;
            __IOM uint32_t OSSEL2     : 2;
            __IOM uint32_t OSSEL3     : 2;
            __IOM uint32_t OSSEL4     : 2;
            __IOM uint32_t OSSEL5     : 2;
            __IOM uint32_t OSSEL6     : 2;
            __IOM uint32_t OSSEL7     : 2;
            __IOM uint32_t OSSEL8     : 2;
            __IOM uint32_t OSSEL9     : 2;
            __IOM uint32_t OSSEL10    : 2;
            __IOM uint32_t OSSEL11    : 2;
            __IOM uint32_t OSSEL12    : 2;
            __IOM uint32_t OSSEL13    : 2;
            __IOM uint32_t OSSEL14    : 2;
            __IOM uint32_t OSSEL15    : 2;
        } OSSEL_B;
    } ;

    /**GPIO port pull-up/pull-down register*/
    union
    {
        __IOM uint32_t PUPD;

        struct
        {
            __IOM uint32_t PUPD0      : 2;
            __IOM uint32_t PUPD1      : 2;
            __IOM uint32_t PUPD2      : 2;
            __IOM uint32_t PUPD3      : 2;
            __IOM uint32_t PUPD4      : 2;
            __IOM uint32_t PUPD5      : 2;
            __IOM uint32_t PUPD6      : 2;
            __IOM uint32_t PUPD7      : 2;
            __IOM uint32_t PUPD8      : 2;
            __IOM uint32_t PUPD9      : 2;
            __IOM uint32_t PUPD10     : 2;
            __IOM uint32_t PUPD11     : 2;
            __IOM uint32_t PUPD12     : 2;
            __IOM uint32_t PUPD13     : 2;
            __IOM uint32_t PUPD14     : 2;
            __IOM uint32_t PUPD15     : 2;
        } PUPD_B;
    } ;

    /**GPIO port input data register*/
    union
    {
        __IM  uint32_t IDATA;

        struct
        {
            __IM  uint32_t IDATA0       : 1;
            __IM  uint32_t IDATA1       : 1;
            __IM  uint32_t IDATA2       : 1;
            __IM  uint32_t IDATA3       : 1;
            __IM  uint32_t IDATA4       : 1;
            __IM  uint32_t IDATA5       : 1;
            __IM  uint32_t IDATA6       : 1;
            __IM  uint32_t IDATA7       : 1;
            __IM  uint32_t IDATA8       : 1;
            __IM  uint32_t IDATA9       : 1;
            __IM  uint32_t IDATA10      : 1;
            __IM  uint32_t IDATA11      : 1;
            __IM  uint32_t IDATA12      : 1;
            __IM  uint32_t IDATA13      : 1;
            __IM  uint32_t IDATA14      : 1;
            __IM  uint32_t IDATA15      : 1;
            __IM  uint32_t RESERVED1    : 16;
        } IDATA_B;
    } ;

