frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/Device/Geehy/APM32L0xx/Include/apm32l0xx.h
    /**Own address register 2*/
    union
    {
        __IOM uint32_t ADDR2;

        struct
        {
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t ADDR2      : 7;
            __IOM uint32_t ADDR2MSK   : 3;
            __IM  uint32_t RESERVED2  : 4;
            __IOM uint32_t ADDR2EN    : 1;
            __IM  uint32_t RESERVED3  : 16;
        } ADDR2_B;
    } ;

    /**Timing register*/
    union
    {
        __IOM uint32_t TIMING;

        struct
        {
            __IOM uint32_t SCLL       : 8;
            __IOM uint32_t SCLH       : 8;
            __IOM uint32_t DATAHT     : 4;
            __IOM uint32_t DATAT      : 4;
            __IM  uint32_t RESERVED1  : 4;
            __IOM uint32_t TIMINGPSC  : 4;
        } TIMING_B;
    } ;

    /**Status register 1*/
    union
    {
        __IOM uint32_t TIMEOUT;

        struct
        {
            __IOM uint32_t TIMEOUTA   : 12;
            __IOM uint32_t IDLECLKTO  : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t CLKTOEN    : 1;
            __IOM uint32_t TIMEOUTB   : 12;
            __IM  uint32_t RESERVED2  : 3;
            __IOM uint32_t EXCLKTOEN  : 1;
        } TIMEOUT_B;
    } ;

    /**Interrupt and Status register*/
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IOM uint32_t TXBEFLG    : 1;
            __IOM uint32_t TXINTFLG   : 1;
            __IM  uint32_t RXBNEFLG   : 1;
            __IM  uint32_t ADDRMFLG   : 1;
            __IM  uint32_t NACKFLG    : 1;
            __IM  uint32_t STOPFLG    : 1;
            __IM  uint32_t TXCFLG     : 1;
            __IM  uint32_t TXCRFLG    : 1;
            __IM  uint32_t BERRFLG    : 1;
            __IM  uint32_t ALFLG      : 1;
            __IM  uint32_t OVRURFLG   : 1;
            __IM  uint32_t PECEFLG    : 1;
            __IM  uint32_t TTEFLG     : 1;
            __IM  uint32_t SMBALTFLG  : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IM  uint32_t BUSBSYFLG  : 1;
            __IM  uint32_t TXDIRFLG   : 1;
            __IM  uint32_t ADDRCMFLG  : 7;
            __IM  uint32_t RESERVED2  : 8;
        } STS_B;
    } ;

    /**Interrupt clear register*/
    union
    {
        __OM  uint32_t INTFCLR;

        struct
        {
            __IM  uint32_t RESERVED1  : 3;
            __OM  uint32_t ADDRMCLR   : 1;
            __OM  uint32_t NACKCLR    : 1;
            __OM  uint32_t STOPCLR    : 1;
            __IM  uint32_t RESERVED2  : 2;
            __OM  uint32_t BERRCLR    : 1;
            __OM  uint32_t ALCLR      : 1;
            __OM  uint32_t OVRURCLR   : 1;
            __OM  uint32_t PECECLR    : 1;
            __OM  uint32_t TTECLR     : 1;
            __OM  uint32_t SMBALTCLR  : 1;
            __IM  uint32_t RESERVED3  : 18;
        } INTFCLR_B;
    } ;

    /**PEC data register*/
    union
    {
        __IM  uint32_t PEC;

        struct
        {
            __IM  uint32_t PEC        : 8;
            __IM  uint32_t RESERVED1  : 24;
        } PEC_B;
    } ;

    /**Receive data register*/
    union
    {
        __IM  uint32_t RXDATA;

        struct
        {
            __IM  uint32_t RXDATA     : 8;
            __IM  uint32_t RESERVED1  : 24;
        } RXDATA_B;
    } ;

    /**Transmit data register*/
    union
    {
        __IOM uint32_t TXDATA;

        struct
        {
            __IOM uint32_t TXDATA     : 8;
            __IOM uint32_t RESERVED1  : 24;
        } TXDATA_B;
    } ;
} I2C_T;

/**
  * @brief Independent watchdog (IWDT)
  */

typedef struct
{
    /** Key register */
    union
    {
        __OM  uint32_t KEY;

        struct
        {
            __OM  uint32_t KEY        : 16;
            __IM  uint32_t RESERVED1  : 16;
        } KEY_B;
    } ;

    /** Prescaler register */
    union
    {
        __IOM uint32_t PSC;

        struct
        {
            __IOM uint32_t PSC        : 3;
            __IM  uint32_t RESERVED1  : 29;
        } PSC_B;
    } ;

    /** Counter reload register */
    union
    {
        __IOM uint32_t CNTRLD;

        struct
        {
            __IOM uint32_t CNTRLD     : 12;
            __IM  uint32_t RESERVED1  : 20;
        } CNTRLD_B;
    } ;

    /** Status register */
    union
    {
        __IM  uint32_t STS;

        struct
        {
            __IM  uint32_t PSCUFLG    : 1;
            __IM  uint32_t CNTUFLG    : 1;
            __IM  uint32_t WINUFLG    : 1;
            __IM  uint32_t RESERVED1  : 29;
        } STS_B;
    } ;

    /** Window register */
    union
    {
        __IOM uint32_t WIN;

        struct
        {
            __IOM uint32_t WIN        : 12;
            __IM  uint32_t RESERVED1  : 20;
        } WIN_B;
    } ;
} IWDT_T;

/**
  * @brief Power control (PMU)
  */

typedef struct
{
    /**power control register*/
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t LPDSCFG    : 1;
            __IOM uint32_t PDDSCFG    : 1;
            __IOM uint32_t WUFLGCLR   : 1;
            __IOM uint32_t SBFLGCLR   : 1;
            __IOM uint32_t PVDEN      : 1;
            __IOM uint32_t PLSEL      : 3;
            __IOM uint32_t BPWEN      : 1;
            __IOM uint32_t ULP        : 1;
            __IOM uint32_t FWUP       : 1;
            __IOM uint32_t VSRSEL     : 2;
            __IOM uint32_t DSOFF      : 1;
            __IOM uint32_t LPRUNCFG   : 1;
            __IM  uint32_t RESERVED1  : 17;
        } CTRL_B;
    } ;

    /**power control/status register*/
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IM  uint32_t WUEFLG     : 1;
            __IM  uint32_t SBFLG      : 1;
            __IM  uint32_t PVDOFLG    : 1;
            __IM  uint32_t VREFINTRDY : 1;
            __IM  uint32_t VSFLG      : 1;
            __IM  uint32_t REGLPFLG   : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t WKUPCFG1   : 1;
            __IOM uint32_t WKUPCFG2   : 1;
            __IOM uint32_t WKUPCFG3   : 1;
            __IM  uint32_t RESERVED2  : 21;
        } CSTS_B;
    } ;
} PMU_T;

/**
  * @brief Reset and clock control (RCM)
  */

typedef struct
{
    /** Clock control register 1*/
    union
    {
        /** Clock control register */
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t HSI16EN      : 1;
            __IOM uint32_t HSI16FEN     : 1;
            __IM  uint32_t HSI16RDYFLG  : 1;
            __IOM uint32_t HSI16DIVEN   : 1;
            __IM  uint32_t HSI16DIVFLG  : 1;
            __IOM uint32_t HSI16OUTEN   : 1;
            __IM  uint32_t RESERVED1    : 2;
            __IOM uint32_t MSIEN        : 1;
            __IM  uint32_t MSIRDYFLG    : 1;
            __IM  uint32_t RESERVED2    : 6;
            __IOM uint32_t HSEEN        : 1;
            __IM  uint32_t HSERDYFLG    : 1;
            __IOM uint32_t HSEBCFG      : 1;
            __IOM uint32_t CSSEN        : 1;
            __IOM uint32_t RTCPSC       : 2;
            __IM  uint32_t RESERVED3    : 2;
            __IOM uint32_t PLLEN        : 1;
            __IM  uint32_t PLLRDYFLG    : 1;
            __IM  uint32_t RESERVED4    : 6;
        } CTRL_B;
    } ;

    /** RCM ICLKCAL */
    union
    {
        __IOM uint32_t ICLKCAL;

        struct
        {
            __IM  uint32_t HSI16CAL     : 8;
            __IOM uint32_t HSI16TMR     : 5;
            __IOM uint32_t MSIR         : 3;
            __IM  uint32_t MSICAL       : 8;
            __IOM uint32_t MSITIM       : 8;
        } ICLKCAL_B;
    } ;

    /** RCM HSI48CFG */
    union
    {
        __IOM uint32_t HSI48CFG;

        struct
        {
            __IOM uint32_t HSI48EN      : 1;
            __IM  uint32_t HSI48RDYFLG  : 1;
            __IOM uint32_t HSI48DIVEN   : 1;
            __IM  uint32_t RESERVED1    : 5;
            __IOM uint32_t HSI48CAL     : 8;
            __IM  uint32_t RESERVED2    : 16;
        } HSI48CFG_B;
    } ;

    /** Clock configuration register */
    union
    {
        __IOM uint32_t CFG;

        struct
        {
            __IOM uint32_t SCLKSEL    : 2;
            __IM  uint32_t SCLKSWSTS  : 2;
            __IOM uint32_t AHBPSC     : 4;
            __IOM uint32_t APB1PSC    : 3;
            __IOM uint32_t APB2PSC    : 3;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t WUCLKSEL   : 1;
            __IOM uint32_t PLLINSEL   : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t PLLMUL     : 4;
            __IOM uint32_t PLLOUTDIV  : 2;
            __IOM uint32_t MCOSEL     : 4;
            __IOM uint32_t MCOPSC     : 3;
            __IM  uint32_t RESERVED3  : 1;
        } CFG_B;
    } ;

    /** Clock interrupt enable register */
    union
    {
        __IOM uint32_t INTEN;

        struct
        {
            __IOM uint32_t LSIRDYEN   : 1;
            __IOM uint32_t LSERDYEN   : 1;
            __IOM uint32_t HSI16RDYEN : 1;
            __IOM uint32_t HSERDYEN   : 1;
            __IOM uint32_t PLLRDYEN   : 1;
            __IOM uint32_t MSIRDYEN   : 1;
            __IOM uint32_t HSI48RDYEN : 1;
            __IOM uint32_t CSSLRDYEN  : 1;
            __IM  uint32_t RESERVED   : 24;
        } INTEN_B;
    } ;

    /** Clock interrupt status register */
    union
    {
        __IM uint32_t INTSTS;

        struct
        {
            __IM  uint32_t LSIFLG     : 1;
            __IM  uint32_t LSEFLG     : 1;
            __IM  uint32_t HSI16FLG   : 1;
            __IM  uint32_t HSEFLG     : 1;
            __IM  uint32_t PLLFLG     : 1;
            __IM  uint32_t MSIFLG     : 1;
            __IM  uint32_t HSI48FLG   : 1;
            __IM  uint32_t LCSSFLG    : 1;
            __IM  uint32_t HCSSFLG    : 1;
            __IM  uint32_t RESERVED   : 23;
        } INTSTS_B;
    } ;

    /** Clock interrupt status clear register */
    union
    {
        __IOM uint32_t INTCLR;

        struct
        {

