frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/Device/Geehy/APM32L0xx/Include/apm32l0xx.h
            __OM  uint32_t LSIFLGCLR   : 1;
            __OM  uint32_t LSEFLGCLR   : 1;
            __OM  uint32_t HSI16FLGCLR : 1;
            __OM  uint32_t HSEFLGCLR   : 1;
            __OM  uint32_t PLLFLGCLR   : 1;
            __OM  uint32_t MSIFLGCLR   : 1;
            __OM  uint32_t HSI48FLGCLR : 1;
            __OM  uint32_t LCSSFLGCLR  : 1;
            __OM  uint32_t HCSSFLGCLR  : 1;
            __IM  uint32_t RESERVED    : 23;
        } INTCLR_B;
    } ;

    /** GPIO port reset register */
    union
    {
        __IOM uint32_t GPIORST;

        struct
        {
            __IOM uint32_t PARST      : 1;
            __IOM uint32_t PBRST      : 1;
            __IOM uint32_t PCRST      : 1;
            __IOM uint32_t PDRST      : 1;
            __IOM uint32_t PERST      : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t PHRST      : 1;
            __IM  uint32_t RESERVED2  : 24;
        } GPIORST_B;
    } ;

    /** AHB peripheral reset register */
    union
    {
        __IOM uint32_t AHBRST;

        struct
        {
            __IOM uint32_t DMARST      : 1;
            __IM  uint32_t RESERVED1   : 7;
            __IOM uint32_t MEMITFRST   : 1;
            __IM  uint32_t RESERVED2   : 3;
            __IOM uint32_t CRCRST      : 1;
            __IM  uint32_t RESERVED3   : 3;
            __IOM uint32_t TSCRST      : 1;
            __IM  uint32_t RESERVED4   : 3;
            __IOM uint32_t RNGRST      : 1;
            __IM  uint32_t RESERVED5   : 3;
            __IOM uint32_t CRYPRST     : 1;
            __IM  uint32_t RESERVED6   : 7;
        } AHBRST_B;
    } ;

    /**APB2 peripheral reset register*/
    union
    {
        __IOM uint32_t APB2RST;

        struct
        {
            __IOM uint32_t SYSCFGRST    : 1;
            __IM  uint32_t RESERVED1    : 1;
            __IOM uint32_t TMR21RST     : 1;
            __IM  uint32_t RESERVED2    : 2;
            __IOM uint32_t TMR22RST     : 1;
            __IM  uint32_t RESERVED3    : 3;
            __IOM uint32_t ADCRST       : 1;
            __IM  uint32_t RESERVED4    : 2;
            __IOM uint32_t SPI1RST      : 1;
            __IM  uint32_t RESERVED5    : 1;
            __IOM uint32_t USART1RST    : 1;
            __IM  uint32_t RESERVED6    : 7;
            __IOM uint32_t DBGRST       : 1;
            __IM  uint32_t RESERVED7    : 9;
        } APB2RST_B;
    } ;

    /**APB1 peripheral reset register*/
    union
    {
        __IOM uint32_t APB1RST;

        struct
        {
            __IOM uint32_t TMR2RST       : 1;
            __IOM uint32_t TMR3RST       : 1;
            __IM  uint32_t RESERVED1     : 2;
            __IOM uint32_t TMR6RST       : 1;
            __IOM uint32_t TMR7RST       : 1;
            __IM  uint32_t RESERVED2     : 3;
            __IOM uint32_t LCDRST        : 1;
            __IM  uint32_t RESERVED3     : 1;
            __IOM uint32_t WWDTRST       : 1;
            __IM  uint32_t RESERVED4     : 2;
            __IOM uint32_t SPI2RST       : 1;
            __IM  uint32_t RESERVED5     : 2;
            __IOM uint32_t USART2RST     : 1;
            __IOM uint32_t LPUART1RST    : 1;
            __IOM uint32_t USART4RST     : 1;
            __IOM uint32_t USART5RST     : 1;
            __IOM uint32_t I2C1RST       : 1;
            __IOM uint32_t I2C2RST       : 1;
            __IOM uint32_t USBRST        : 1;
            __IM  uint32_t RESERVED6     : 3;
            __IOM uint32_t CRSRST        : 1;
            __IOM uint32_t PMURST        : 1;
            __IOM uint32_t DACRST        : 1;
            __IOM uint32_t I2C3RST       : 1;
            __IOM uint32_t LPTMR1RST     : 1;
        } APB1RST_B;
    } ;

    /** GPIO port enable register */
    union
    {
        __IOM uint32_t GPIOEN;

        struct
        {
            __IOM uint32_t PAEN       : 1;
            __IOM uint32_t PBEN       : 1;
            __IOM uint32_t PCEN       : 1;
            __IOM uint32_t PDEN       : 1;
            __IOM uint32_t PEEN       : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t PHEN       : 1;
            __IM  uint32_t RESERVED2  : 24;
        } GPIOEN_B;
    } ;

    /** AHB peripheral enable register */
    union
    {
        __IOM uint32_t AHBEN;

        struct
        {
            __IOM uint32_t DMAEN       : 1;
            __IM  uint32_t RESERVED1   : 7;
            __IOM uint32_t MEMITFEN    : 1;
            __IM  uint32_t RESERVED2   : 3;
            __IOM uint32_t CRCEN       : 1;
            __IM  uint32_t RESERVED3   : 3;
            __IOM uint32_t TSCEN       : 1;
            __IM  uint32_t RESERVED4   : 3;
            __IOM uint32_t RNGEN       : 1;
            __IM  uint32_t RESERVED5   : 3;
            __IOM uint32_t CRYPEN      : 1;
            __IM  uint32_t RESERVED6   : 7;
        } AHBEN_B;
    } ;

    /**APB2 peripheral enable register*/
    union
    {
        __IOM uint32_t APB2EN;

        struct
        {
            __IOM uint32_t SYSCFGEN    : 1;
            __IM  uint32_t RESERVED1   : 1;
            __IOM uint32_t TMR21EN     : 1;
            __IM  uint32_t RESERVED2   : 2;
            __IOM uint32_t TMR22EN     : 1;
            __IM  uint32_t RESERVED3   : 1;
            __IOM uint32_t FWLEN       : 1;
            __IM  uint32_t RESERVED4   : 1;
            __IOM uint32_t ADCEN       : 1;
            __IM  uint32_t RESERVED5   : 2;
            __IOM uint32_t SPI1EN      : 1;
            __IM  uint32_t RESERVED6   : 1;
            __IOM uint32_t USART1EN    : 1;
            __IM  uint32_t RESERVED7   : 7;
            __IOM uint32_t DBGEN       : 1;
            __IM  uint32_t RESERVED8   : 9;
        } APB2EN_B;
    } ;

    /**APB1 peripheral reset register*/
    union
    {
        __IOM uint32_t APB1EN;

        struct
        {
            __IOM uint32_t TMR2EN       : 1;
            __IOM uint32_t TMR3EN       : 1;
            __IM  uint32_t RESERVED1    : 2;
            __IOM uint32_t TMR6EN       : 1;
            __IOM uint32_t TMR7EN       : 1;
            __IM  uint32_t RESERVED2    : 3;
            __IOM uint32_t LCDEN        : 1;
            __IM  uint32_t RESERVED3    : 1;
            __IOM uint32_t WWDTEN       : 1;
            __IM  uint32_t RESERVED4    : 2;
            __IOM uint32_t SPI2EN       : 1;
            __IM  uint32_t RESERVED5    : 2;
            __IOM uint32_t USART2EN     : 1;
            __IOM uint32_t LPUART1EN    : 1;
            __IOM uint32_t USART4EN     : 1;
            __IOM uint32_t USART5EN     : 1;
            __IOM uint32_t I2C1EN       : 1;
            __IOM uint32_t I2C2EN       : 1;
            __IOM uint32_t USBEN        : 1;
            __IM  uint32_t RESERVED6    : 3;
            __IOM uint32_t CRSEN        : 1;
            __IOM uint32_t PMUEN        : 1;
            __IOM uint32_t DACEN        : 1;
            __IOM uint32_t I2C3EN       : 1;
            __IOM uint32_t LPTMR1EN     : 1;
        } APB1EN_B;
    } ;

    /** GPIO port enable register in sleep mode */
    union
    {
        __IOM uint32_t SLPGPIOEN;

        struct
        {
            __IOM uint32_t PAEN       : 1;
            __IOM uint32_t PBEN       : 1;
            __IOM uint32_t PCEN       : 1;
            __IOM uint32_t PDEN       : 1;
            __IOM uint32_t PEEN       : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t PHEN       : 1;
            __IM  uint32_t RESERVED2  : 24;
        } SLPGPIOEN_B;
    } ;

    /** AHB peripheral enable register in sleep mode */
    union
    {
        __IOM uint32_t SLPAHBEN;

        struct
        {
            __IOM uint32_t DMAEN       : 1;
            __IM  uint32_t RESERVED1   : 7;
            __IOM uint32_t MEMITFEN    : 1;
            __IOM uint32_t SRAMEN      : 1;
            __IM  uint32_t RESERVED2   : 2;
            __IOM uint32_t CRCEN       : 1;
            __IM  uint32_t RESERVED3   : 3;
            __IOM uint32_t TSCEN       : 1;
            __IM  uint32_t RESERVED4   : 3;
            __IOM uint32_t RNGEN       : 1;
            __IM  uint32_t RESERVED5   : 3;
            __IOM uint32_t CRYPEN      : 1;
            __IM  uint32_t RESERVED6   : 7;
        } SLPAHBEN_B;
    } ;

