frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/Device/Geehy/APM32L0xx/Include/apm32l0xx.h
    /**APB2 peripheral enable register in sleep mode*/
    union
    {
        __IOM uint32_t SLPAPB2EN;

        struct
        {
            __IOM uint32_t SYSCFGEN    : 1;
            __IM  uint32_t RESERVED1   : 1;
            __IOM uint32_t TMR21EN     : 1;
            __IM  uint32_t RESERVED2   : 2;
            __IOM uint32_t TMR22EN     : 1;
            __IM  uint32_t RESERVED3   : 3;
            __IOM uint32_t ADCEN       : 1;
            __IM  uint32_t RESERVED4   : 2;
            __IOM uint32_t SPI1EN      : 1;
            __IM  uint32_t RESERVED5   : 1;
            __IOM uint32_t USART1EN    : 1;
            __IM  uint32_t RESERVED6   : 7;
            __IOM uint32_t DBGEN       : 1;
            __IM  uint32_t RESERVED7   : 9;
        } SLPAPB2EN_B;
    } ;

    /**APB1 peripheral reset register in sleep mode*/
    union
    {
        __IOM uint32_t SLPAPB1EN;

        struct
        {
            __IOM uint32_t TMR2EN       : 1;
            __IOM uint32_t TMR3EN       : 1;
            __IM  uint32_t RESERVED1    : 2;
            __IOM uint32_t TMR6EN       : 1;
            __IOM uint32_t TMR7EN       : 1;
            __IM  uint32_t RESERVED2    : 3;
            __IOM uint32_t LCDEN        : 1;
            __IM  uint32_t RESERVED3    : 1;
            __IOM uint32_t WWDTEN       : 1;
            __IM  uint32_t RESERVED4    : 2;
            __IOM uint32_t SPI2EN       : 1;
            __IM  uint32_t RESERVED5    : 2;
            __IOM uint32_t USART2EN     : 1;
            __IOM uint32_t LPUART1EN    : 1;
            __IOM uint32_t USART4EN     : 1;
            __IOM uint32_t USART5EN     : 1;
            __IOM uint32_t I2C1EN       : 1;
            __IOM uint32_t I2C2EN       : 1;
            __IOM uint32_t USBEN        : 1;
            __IM  uint32_t RESERVED6    : 3;
            __IOM uint32_t CRSEN        : 1;
            __IOM uint32_t PMUEN        : 1;
            __IOM uint32_t DACEN        : 1;
            __IOM uint32_t I2C3EN       : 1;
            __IOM uint32_t LPTMR1EN     : 1;
        } SLPAPB1EN_B;
    } ;

    /** Peripheral clock source selection register*/
    union
    {
        __IOM uint32_t CLKSEL;

        struct
        {
            __IOM uint32_t USART1SEL    : 2;
            __IOM uint32_t USART2SEL    : 2;
            __IM  uint32_t RESERVED1    : 6;
            __IOM uint32_t LPUART1SEL   : 2;
            __IOM uint32_t I2C1SEL      : 2;
            __IM  uint32_t RESERVED2    : 2;
            __IOM uint32_t I2C3SEL      : 2;
            __IOM uint32_t LPTMR1SEL    : 2;
            __IM  uint32_t RESERVED3    : 6;
            __IOM uint32_t HSI48SEL     : 1;
            __IM  uint32_t RESERVED4    : 5;
        } CLKSEL_B;
    } ;

    /**Control/status register*/
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IOM uint32_t LSIEN        : 1;
            __IM  uint32_t LSIRDYFLG    : 1;
            __IM  uint32_t RESERVED1    : 6;
            __IOM uint32_t LSEEN        : 1;
            __IM  uint32_t LSERDYFLG    : 1;
            __IOM uint32_t LSEBCFG      : 1;
            __IOM uint32_t LSEDRIVE     : 2;
            __IOM uint32_t CSSLEN       : 1;
            __IM  uint32_t CSSLFAIL     : 1;
            __IM  uint32_t RESERVED2    : 1;
            __IOM uint32_t RTCSEL       : 2;
            __IOM uint32_t RTCEN        : 1;
            __IOM uint32_t RTCRST       : 1;
            __IM  uint32_t RESERVED3    : 3;
            __IOM uint32_t RSTFLGCLR    : 1;
            __IM  uint32_t FWLRSTFLG    : 1;
            __IM  uint32_t OBLRSTFLG    : 1;
            __IM  uint32_t PINRSTFLG    : 1;
            __IM  uint32_t PODRRSTFLG   : 1;
            __IM  uint32_t SWRSTFLG     : 1;
            __IM  uint32_t IWDTRSTFLG   : 1;
            __IM  uint32_t WWDTRSTFLG   : 1;
            __IM  uint32_t LPRSTFLG     : 1;
        } CSTS_B;
    } ;
} RCM_T;

/**
  * @brief Real-time clock (RTC)
  */

typedef struct
{

    /** time register */
    union
    {
        __IOM uint32_t TIME;

        struct
        {
            __IOM uint32_t SECU       : 4;
            __IOM uint32_t SECT       : 3;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t MINU       : 4;
            __IOM uint32_t MINT       : 3;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t HRU        : 4;
            __IOM uint32_t HRT        : 2;
            __IOM uint32_t TIMEFCFG   : 1;
            __IM  uint32_t RESERVED3  : 9;
        } TIME_B;
    } ;

    /** date register */
    union
    {
        __IOM uint32_t DATE;

        struct
        {
            __IOM uint32_t DAYU       : 4;
            __IOM uint32_t DAYT       : 2;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t MONU       : 4;
            __IOM uint32_t MONT       : 1;
            __IOM uint32_t WEEKSEL    : 3;
            __IOM uint32_t YRU        : 4;
            __IOM uint32_t YRT        : 4;
            __IM  uint32_t RESERVED2  : 8;
        } DATE_B;
    } ;

    /** control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t WUCLKSEL   : 3;
            __IOM uint32_t TSETECFG   : 1;
            __IOM uint32_t RCLKDEN    : 1;
            __IOM uint32_t RCMCFG     : 1;
            __IOM uint32_t TIMEFCFG   : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t ALRAEN     : 1;
            __IOM uint32_t ALRBEN     : 1;
            __IOM uint32_t WUTEN      : 1;
            __IOM uint32_t TSEN       : 1;
            __IOM uint32_t ALRAIEN    : 1;
            __IOM uint32_t ALRBIEN    : 1;
            __IOM uint32_t WUTIEN     : 1;
            __IOM uint32_t TSIEN      : 1;
            __OM  uint32_t STCCFG     : 1;
            __OM  uint32_t WTCCFG     : 1;
            __IOM uint32_t BAKP       : 1;
            __IOM uint32_t CALOSEL    : 1;
            __IOM uint32_t POLCFG     : 1;
            __IOM uint32_t OUTSEL     : 2;
            __IOM uint32_t CALOEN     : 1;
            __IM  uint32_t RESERVED4  : 8;
        } CTRL_B;
    } ;

    /** initialization and status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM  uint32_t ALRAWFLG   : 1;
            __IM  uint32_t ALRBWFLG   : 1;
            __IM  uint32_t WUTWFLG    : 1;
            __IM  uint32_t SOPFLG     : 1;
            __IM  uint32_t INITSFLG   : 1;
            __IOM uint32_t RSFLG      : 1;
            __IM  uint32_t RINITFLG   : 1;
            __IOM uint32_t INITEN     : 1;
            __IOM uint32_t ALRAFLG    : 1;
            __IOM uint32_t ALRBFLG    : 1;
            __IOM uint32_t WUTFLG     : 1;
            __IOM uint32_t TSFLG      : 1;
            __IOM uint32_t TSOVRFLG   : 1;
            __IOM uint32_t TP1FLG     : 1;
            __IOM uint32_t TP2FLG     : 1;
            __IOM  uint32_t TP3FLG    : 1;
            __IM  uint32_t RCALPFLG   : 1;
            __IM  uint32_t RESERVED3  : 15;
        } STS_B;
    } ;

    /** prescaler register */
    union
    {
        __IOM uint32_t PSC;

        struct
        {
            __IOM uint32_t SPSC       : 15;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t APSC       : 7;
            __IM  uint32_t RESERVED2  : 9;
        } PSC_B;
    } ;

    /** auto-reload register */
    union
    {
        __IOM  uint32_t AUTORLD;

        struct
        {
            __IOM  uint32_t WUAUTORE  : 15;
            __IM  uint32_t RESERVED1  : 17;
        } AUTORLD_B;
    } ;

    __IM  uint32_t  RESERVED;

    /** alarm A register */
    union
    {
        __IOM uint32_t ALRMA;

        struct
        {
            __IOM uint32_t SECU       : 4;
            __IOM uint32_t SECT       : 3;
            __IOM uint32_t SECMEN     : 1;
            __IOM uint32_t MINU       : 4;
            __IOM uint32_t MINT       : 3;
            __IOM uint32_t MINMEN     : 1;
            __IOM uint32_t HRU        : 4;
            __IOM uint32_t HRT        : 2;
            __IOM uint32_t TIMEFCFG   : 1;
            __IOM uint32_t HRMEN      : 1;
            __IOM uint32_t DAYU       : 4;
            __IOM uint32_t DAYT       : 2;
            __IOM uint32_t WEEKSEL    : 1;
            __IOM uint32_t DATEMEN    : 1;
        } ALRMA_B;
    } ;

