frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/Device/Geehy/APM32L0xx/Include/apm32l0xx.h
    /** control register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IOM uint32_t RXDEN      : 1;
            __IOM uint32_t TXDEN      : 1;
            __IOM uint32_t SSOEN      : 1;
            __IOM uint32_t RESERVED1  : 1;
            __IOM uint32_t FRFCFG     : 1;
            __IOM uint32_t ERRIEN     : 1;
            __IOM uint32_t RXBNEIEN   : 1;
            __IOM uint32_t TXBEIEN    : 1;
            __IM  uint32_t RESERVED2  : 24;
        } CTRL2_B;
    } ;

    /** status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM  uint32_t RXBNEFLG   : 1;
            __IM  uint32_t TXBEFLG    : 1;
            __IM  uint32_t SCHDIR     : 1;
            __IM  uint32_t UDRFLG     : 1;
            __IOM uint32_t CRCEFLG    : 1;
            __IM  uint32_t MEFLG      : 1;
            __IM  uint32_t OVRFLG     : 1;
            __IM  uint32_t BSYFLG     : 1;
            __IM  uint32_t FREFLG     : 1;
            __IM  uint32_t RESERVED1  : 23;
        } STS_B;
    } ;

    /** data register */
    union
    {
        __IOM uint32_t DATA;

        struct
        {
            __IOM uint32_t DATA       : 16;
            __IM  uint32_t RESERVED1  : 16;
        } DATA_B;
    } ;

    /** CRC polynomial register */
    union
    {
        __IOM uint32_t CRCPOLY;

        struct
        {
            __IOM uint32_t CRCPOLY    : 16;
            __IM  uint32_t RESERVED1  : 16;
        } CRCPOLY_B;
    } ;

    /**RX CRC register */
    union
    {

        __IM  uint32_t RXCRC;

        struct
        {
            __IM  uint32_t RXCRC      : 16;
            __IM  uint32_t RESERVED1  : 16;
        } RXCRC_B;
    } ;

    /** TX CRC register */
    union
    {

        __IM  uint32_t TXCRC;

        struct
        {
            __IM  uint32_t TXCRC      : 16;
            __IM  uint32_t RESERVED1  : 16;
        } TXCRC_B;
    } ;

    /** I2S CFG register */
    union
    {
        __IOM uint32_t I2SCFG;

        struct
        {
            __IOM uint32_t CHLEN      : 1;
            __IOM uint32_t DATALEN    : 2;
            __IOM uint32_t CPOL       : 1;
            __IOM uint32_t I2SSSEL    : 2;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t PFSSEL     : 1;
            __IOM uint32_t I2SMOD     : 2;
            __IOM uint32_t I2SEN      : 1;
            __IOM uint32_t MODESEL    : 1;
            __IM  uint32_t RESERVED2  : 20;
        } I2SCFG_B;
    } ;

    /** I2S Prescaler */
    union
    {
        __IOM uint32_t I2SPSC;

        struct
        {
            __IOM uint32_t I2SPSC     : 8;
            __IOM uint32_t ODDPSC     : 1;
            __IOM uint32_t MCOEN      : 1;
            __IM  uint32_t RESERVED1  : 22;
        } I2SPSC_B;
    } ;
} SPI_T;

/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct
{
    /** Memory Remap selects register  */
    union
    {
        __IOM uint32_t MMSEL;

        struct
        {
            __IOM uint32_t MMSEL        : 2;
            __IM  uint32_t RESERVED1    : 1;
            __IOM uint32_t BMAP         : 1;
            __IM  uint32_t RESERVED2    : 4;
            __IM uint32_t BOOTMOD       : 2;
            __IM  uint32_t RESERVED3    : 22;
        } MMSEL_B;
    } ;

    /** external model configuration register 1 */
    union
    {

        __IOM uint32_t PMCFG1;

        struct
        {
            __IOM uint32_t FWLDIS       : 1;
            __IM  uint32_t RESERVED1    : 7;
            __IOM uint32_t PB6FMP       : 1;
            __IOM uint32_t PB7FMP       : 1;
            __IOM uint32_t PB8FMP       : 1;
            __IOM uint32_t PB9FMP       : 1;
            __IOM uint32_t I2C1FMP      : 1;
            __IOM uint32_t I2C2FMP      : 1;
            __IOM uint32_t I2C3FMP      : 1;
            __IM  uint32_t RESERVED2    : 17;
        } PMCFG1_B;
    } ;

    /** external interrupt configuration register 1 */
    union
    {
        __IOM uint32_t EINTCFG1;

        struct
        {
            __IOM uint32_t EINT0      : 4;
            __IOM uint32_t EINT1      : 4;
            __IOM uint32_t EINT2      : 4;
            __IOM uint32_t EINT3      : 4;
            __IM  uint32_t RESERVED1  : 16;
        } EINTCFG1_B;
    } ;


      /** external interrupt configuration register 2 */
    union
    {
        __IOM uint32_t EINTCFG2;

        struct
        {
            __IOM uint32_t EINT4      : 4;
            __IOM uint32_t EINT5      : 4;
            __IOM uint32_t EINT6      : 4;
            __IOM uint32_t EINT7      : 4;
            __IM  uint32_t RESERVED1  : 16;
        } EINTCFG2_B;
    } ;


  /** external interrupt configuration register 1 */
    union
    {
        __IOM uint32_t EINTCFG3;

        struct
        {
            __IOM uint32_t EINT8       : 4;
            __IOM uint32_t EINT9       : 4;
            __IOM uint32_t EINT10      : 4;
            __IOM uint32_t EINT11      : 4;
            __IM  uint32_t RESERVED1   : 16;
        } EINTCFG3_B;
    } ;

    /** external interrupt configuration register 4 */
    union
    {
        __IOM uint32_t EINTCFG4;

        struct
        {
            __IOM uint32_t EINT12     : 4;
            __IOM uint32_t EINT13     : 4;
            __IOM uint32_t EINT14     : 4;
            __IOM uint32_t EINT15     : 4;
            __IM  uint32_t RESERVED1  : 16;
        } EINTCFG4_B;
    } ;

    __IM  uint32_t  RESERVED[2];

    /** external model configuration register 2*/
    union
    {
         __IOM uint32_t PMCFG2;

        struct
        {
            __IOM uint32_t VREFEN          : 1;
            __IM  uint32_t RESERVED1       : 3;
            __IOM uint32_t VREFCSEL        : 2;
            __IM  uint32_t RESERVED2       : 2;
            __IOM uint32_t BUFADCEN        : 1;
            __IOM uint32_t BUFTSEN         : 1;
            __IM  uint32_t RESERVED3       : 2;
            __IOM uint32_t BUFCOMP2EN      : 1;
            __IOM uint32_t BUFHSI48EN      : 1;
            __IM  uint32_t RESERVED4       : 16;
            __IM uint32_t VREFRDYFLG       : 1;
            __IOM uint32_t LOCK            : 1;
        } PMCFG2_B;
    } ;
} SYSCFG_T;

/**
  * @brief Touch sensing controller (TSC)
  */
typedef struct
{
    /** I/O group 1~8 counter register */
    union
    {
        __IM  uint32_t IOGCNT;

        struct
        {
            __IM  uint32_t CNTVAL     : 14;
            __IM  uint32_t RESERVED1  : 18;
        } IOGCNT_B;
    };
} TSC_IOGroupRegister_T;

typedef struct
{
    /** configuration register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t TSCEN      : 1;
            __IOM uint32_t STARTAFLG  : 1;
            __IOM uint32_t AMCFG      : 1;
            __IOM uint32_t SYNCPOL    : 1;
            __IOM uint32_t IODEFCFG   : 1;
            __IOM uint32_t MCNTVSEL   : 3;
            __IM  uint32_t RESERVED1  : 4;
            __IOM uint32_t PGCDFSEL   : 3;
            __IOM uint32_t SSCDFSEL   : 1;
            __IOM uint32_t SSEN       : 1;
            __IOM uint32_t SSERRVSEL  : 7;
            __IOM uint32_t CTPLSEL    : 4;
            __IOM uint32_t CTPHSEL    : 4;
        } CTRL_B;
    } ;

    /** interrupt enable register */
    union
    {
        __IOM uint32_t INTEN;

        struct
        {
            __IOM uint32_t EOAIEN     : 1;
            __IOM uint32_t MCEIEN     : 1;
            __IM  uint32_t RESERVED1  : 30;
        } INTEN_B;
    } ;

    /** interrupt clear register */
    union
    {
        __IOM uint32_t INTFCLR;

        struct
        {
            __IOM uint32_t EOAICLR    : 1;
            __IOM uint32_t MCEICLR    : 1;
            __IM  uint32_t RESERVED1  : 30;
        } INTFCLR_B;
    } ;

    /** interrupt status register */
    union
    {
        __IM uint32_t INTSTS;

        struct
        {
            __IM uint32_t EOAFLG     : 1;
            __IM uint32_t MCEFLG     : 1;
            __IM uint32_t RESERVED1  : 30;
        } INTSTS_B;
    } ;

    /** I/O hysteresis control register */
    union
    {
        __IOM uint32_t IOHCTRL;

        struct
        {
            __IOM uint32_t G1IO1       : 1;
            __IOM uint32_t G1IO2       : 1;
            __IOM uint32_t G1IO3       : 1;
            __IOM uint32_t G1IO4       : 1;
            __IOM uint32_t G2IO1       : 1;
            __IOM uint32_t G2IO2       : 1;
            __IOM uint32_t G2IO3       : 1;
            __IOM uint32_t G2IO4       : 1;
            __IOM uint32_t G3IO1       : 1;
            __IOM uint32_t G3IO2       : 1;
            __IOM uint32_t G3IO3       : 1;
            __IOM uint32_t G3IO4       : 1;
            __IOM uint32_t G4IO1       : 1;
            __IOM uint32_t G4IO2       : 1;
            __IOM uint32_t G4IO3       : 1;
            __IOM uint32_t G4IO4       : 1;
            __IOM uint32_t G5IO1       : 1;
            __IOM uint32_t G5IO2       : 1;
            __IOM uint32_t G5IO3       : 1;
            __IOM uint32_t G5IO4       : 1;
            __IOM uint32_t G6IO1       : 1;
            __IOM uint32_t G6IO2       : 1;
            __IOM uint32_t G6IO3       : 1;
            __IOM uint32_t G6IO4       : 1;
            __IM  uint32_t RESERVED1   : 8;
        } IOHCTRL_B;
    } ;

    __IM  uint32_t  RESERVED1;

    /** I/O analog switch control register */
    union
    {
        __IOM uint32_t IOASWCTRL;

        struct
        {
            __IOM uint32_t G1IO1       : 1;
            __IOM uint32_t G1IO2       : 1;
            __IOM uint32_t G1IO3       : 1;
            __IOM uint32_t G1IO4       : 1;
            __IOM uint32_t G2IO1       : 1;
            __IOM uint32_t G2IO2       : 1;
            __IOM uint32_t G2IO3       : 1;
            __IOM uint32_t G2IO4       : 1;
            __IOM uint32_t G3IO1       : 1;
            __IOM uint32_t G3IO2       : 1;
            __IOM uint32_t G3IO3       : 1;
            __IOM uint32_t G3IO4       : 1;
            __IOM uint32_t G4IO1       : 1;
            __IOM uint32_t G4IO2       : 1;
            __IOM uint32_t G4IO3       : 1;
            __IOM uint32_t G4IO4       : 1;
            __IOM uint32_t G5IO1       : 1;
            __IOM uint32_t G5IO2       : 1;
            __IOM uint32_t G5IO3       : 1;
            __IOM uint32_t G5IO4       : 1;
            __IOM uint32_t G6IO1       : 1;
            __IOM uint32_t G6IO2       : 1;
            __IOM uint32_t G6IO3       : 1;
            __IOM uint32_t G6IO4       : 1;
            __IM  uint32_t RESERVED1   : 8;
        } IOASWCTRL_B;
    } ;
    __IM  uint32_t  RESERVED2;

    /** I/O sampling control register  */
    union
    {
        __IOM uint32_t IOSMPCTRL;

        struct
        {
            __IOM uint32_t G1IO1       : 1;
            __IOM uint32_t G1IO2       : 1;
            __IOM uint32_t G1IO3       : 1;
            __IOM uint32_t G1IO4       : 1;
            __IOM uint32_t G2IO1       : 1;
            __IOM uint32_t G2IO2       : 1;
            __IOM uint32_t G2IO3       : 1;
            __IOM uint32_t G2IO4       : 1;
            __IOM uint32_t G3IO1       : 1;
            __IOM uint32_t G3IO2       : 1;
            __IOM uint32_t G3IO3       : 1;
            __IOM uint32_t G3IO4       : 1;
            __IOM uint32_t G4IO1       : 1;
            __IOM uint32_t G4IO2       : 1;
            __IOM uint32_t G4IO3       : 1;
            __IOM uint32_t G4IO4       : 1;
            __IOM uint32_t G5IO1       : 1;
            __IOM uint32_t G5IO2       : 1;
            __IOM uint32_t G5IO3       : 1;
            __IOM uint32_t G5IO4       : 1;
            __IOM uint32_t G6IO1       : 1;
            __IOM uint32_t G6IO2       : 1;
            __IOM uint32_t G6IO3       : 1;
            __IOM uint32_t G6IO4       : 1;
            __IM  uint32_t RESERVED1   : 8;
        } IOSMPCTRL_B;
    } ;
    __IM  uint32_t  RESERVED3;

