frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/Device/Geehy/APM32L0xx/Include/apm32l0xx.h
    /** I/O channel control register */
    union
    {
        __IOM uint32_t IOCHCTRL;

        struct
        {
            __IOM uint32_t G1IO1       : 1;
            __IOM uint32_t G1IO2       : 1;
            __IOM uint32_t G1IO3       : 1;
            __IOM uint32_t G1IO4       : 1;
            __IOM uint32_t G2IO1       : 1;
            __IOM uint32_t G2IO2       : 1;
            __IOM uint32_t G2IO3       : 1;
            __IOM uint32_t G2IO4       : 1;
            __IOM uint32_t G3IO1       : 1;
            __IOM uint32_t G3IO2       : 1;
            __IOM uint32_t G3IO3       : 1;
            __IOM uint32_t G3IO4       : 1;
            __IOM uint32_t G4IO1       : 1;
            __IOM uint32_t G4IO2       : 1;
            __IOM uint32_t G4IO3       : 1;
            __IOM uint32_t G4IO4       : 1;
            __IOM uint32_t G5IO1       : 1;
            __IOM uint32_t G5IO2       : 1;
            __IOM uint32_t G5IO3       : 1;
            __IOM uint32_t G5IO4       : 1;
            __IOM uint32_t G6IO1       : 1;
            __IOM uint32_t G6IO2       : 1;
            __IOM uint32_t G6IO3       : 1;
            __IOM uint32_t G6IO4       : 1;
            __IM  uint32_t RESERVED1   : 8;
        } IOCHCTRL_B;
    } ;
    __IM  uint32_t  RESERVED4;

    /** I/O group control status register */
    union
    {
        __IOM uint32_t IOGCSTS;

        struct
        {
            __IOM uint32_t G1EN       : 1;
            __IOM uint32_t G2EN       : 1;
            __IOM uint32_t G3EN       : 1;
            __IOM uint32_t G4EN       : 1;
            __IOM uint32_t G5EN       : 1;
            __IOM uint32_t G6EN       : 1;
            __IOM uint32_t G7EN       : 1;
            __IOM uint32_t G8EN       : 1;
            __IM  uint32_t RESERVED1  : 8;
            __IM  uint32_t G1CFLG     : 1;
            __IM  uint32_t G2CFLG     : 1;
            __IM  uint32_t G3CFLG     : 1;
            __IM  uint32_t G4CFLG     : 1;
            __IM  uint32_t G5CFLG     : 1;
            __IM  uint32_t G6CFLG     : 1;
            __IM  uint32_t G7CFLG     : 1;
            __IM  uint32_t G8CFLG     : 1;
            __IM  uint32_t RESERVED2  : 8;
        } IOGCSTS_B;
    } ;

    /** I/O group 1~8 counter register */
    TSC_IOGroupRegister_T IOGxCNT[8];
} TSC_T;

/**
  * @brief timers (TMR)
  */

typedef struct
{
    /** control register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t CNTEN      : 1;
            __IOM uint32_t UD         : 1;
            __IOM uint32_t URSSEL     : 1;
            __IOM uint32_t SPMEN      : 1;
            __IOM uint32_t CNTDIR     : 1;
            __IOM uint32_t CAMSEL     : 2;
            __IOM uint32_t ARPEN      : 1;
            __IOM uint32_t CLKDIV     : 2;
            __IM  uint32_t RESERVED1  : 22;
        } CTRL1_B;
    } ;

    /** control register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IM  uint32_t RESERVED1  : 3;
            __IOM uint32_t CCDSEL     : 1;
            __IOM uint32_t MMSEL      : 3;
            __IOM uint32_t TI1SEL     : 1;
            __IM  uint32_t RESERVED2  : 24;
        } CTRL2_B;
    } ;

    /** slave mode control register */
    union
    {
        __IOM uint32_t SMCTRL;

        struct
        {
            __IOM uint32_t SMFSEL     : 3;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t TRGSEL     : 3;
            __IOM uint32_t MSMEN      : 1;
            __IOM uint32_t ETFCFG     : 4;
            __IOM uint32_t ETPCFG     : 2;
            __IOM uint32_t ECEN       : 1;
            __IOM uint32_t ETPOL      : 1;
            __IM  uint32_t RESERVED2  : 16;
        } SMCTRL_B;
    } ;

    /** DMA/Interrupt enable register */
    union
    {
        __IOM uint32_t DIEN;

        struct
        {
            __IOM uint32_t UIEN       : 1;
            __IOM uint32_t CC1IEN     : 1;
            __IOM uint32_t CC2IEN     : 1;
            __IOM uint32_t CC3IEN     : 1;
            __IOM uint32_t CC4IEN     : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t TRGIEN     : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t UDIEN      : 1;
            __IOM uint32_t CC1DEN     : 1;
            __IOM uint32_t CC2DEN     : 1;
            __IOM uint32_t CC3DEN     : 1;
            __IOM uint32_t CC4DEN     : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t TRGDEN     : 1;
            __IM  uint32_t RESERVED4  : 17;
        } DIEN_B;
    } ;

    /** status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IOM uint32_t UIFLG      : 1;
            __IOM uint32_t CC1IFLG    : 1;
            __IOM uint32_t CC2IFLG    : 1;
            __IOM uint32_t CC3IFLG    : 1;
            __IOM uint32_t CC4IFLG    : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t TRGIFLG    : 1;
            __IM  uint32_t RESERVED2  : 2;
            __IOM uint32_t CC1RCFLG   : 1;
            __IOM uint32_t CC2RCFLG   : 1;
            __IOM uint32_t CC3RCFLG   : 1;
            __IOM uint32_t CC4RCFLG   : 1;
            __IM  uint32_t RESERVED3  : 19;
        } STS_B;
    } ;

    /** event generation register */
    union
    {
        __OM  uint32_t CEG;

        struct
        {
            __OM  uint32_t UEG        : 1;
            __OM  uint32_t CC1EG      : 1;
            __OM  uint32_t CC2EG      : 1;
            __OM  uint32_t CC3EG      : 1;
            __OM  uint32_t CC4EG      : 1;
            __IM  uint32_t RESERVED1  : 1;
            __OM  uint32_t TEG        : 1;
            __IM  uint32_t RESERVED2  : 25;
        } CEG_B;
    } ;

    /** @brief Capture the compare mode register 1 */
    union
    {
        __IOM uint32_t CCM1;

        /** @brief Compare mode */
        struct
        {
            __IOM uint32_t CC1SEL          : 2;
            __IOM uint32_t OC1FEN          : 1;
            __IOM uint32_t OC1PEN          : 1;
            __IOM uint32_t OC1MOD          : 3;
            __IOM uint32_t OC1CEN          : 1;
            __IOM uint32_t CC2SEL          : 2;
            __IOM uint32_t OC2FEN          : 1;
            __IOM uint32_t OC2PEN          : 1;
            __IOM uint32_t OC2MOD          : 3;
            __IOM uint32_t OC2CEN          : 1;
            __IM  uint32_t RESERVED        : 16;
        } CCM1_COMPARE_B;

