frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/Device/Geehy/APM32L0xx/Include/apm32l0xx.h
    /** Key register 0 */
    union
    {
        __IOM uint32_t KEY0;

        struct
        {
            __IOM uint32_t KEY0        : 32;
        } KEY0_B;
    } ;

    /** Key register 1 */
    union
    {
        __IOM uint32_t KEY1;

        struct
        {
            __IOM uint32_t KEY1        : 32;
        } KEY1_B;
    } ;

    /** Key register 2 */
    union
    {
        __IOM uint32_t KEY2;

        struct
        {
            __IOM uint32_t KEY2        : 32;
        } KEY2_B;
    } ;

    /** Key register 3 */
    union
    {
        __IOM uint32_t KEY3;

        struct
        {
            __IOM uint32_t KEY3        : 32;
        } KEY3_B;
    } ;

    /** Initialization vector register 0 */
    union
    {
        __IOM uint32_t INIV0;

        struct
        {
            __IOM uint32_t INIV0       : 32;
        } INIV0_B;
    } ;

    /** Initialization vector register 1 */
    union
    {
        __IOM uint32_t INIV1;

        struct
        {
            __IOM uint32_t INIV1       : 32;
        } INIV1_B;
    } ;

    /** Initialization vector register 2 */
    union
    {
        __IOM uint32_t INIV2;

        struct
        {
            __IOM uint32_t INIV2       : 32;
        } INIV2_B;
    } ;

    /** Initialization vector register 3 */
    union
    {
        __IOM uint32_t INIV3;

        struct
        {
            __IOM uint32_t INIV3       : 32;
        } INIV3_B;
    } ;
} AES_T;

/**
  * @brief   RNG
  */
typedef struct
{
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IM   uint32_t RESERVED1      : 2;
            __IOM  uint32_t RNGEN          : 1;
            __IOM  uint32_t INTEN          : 1;
            __IM   uint32_t RESERVED2      : 1;
            __IOM  uint32_t DISCED         : 1;
            __IM   uint32_t RESERVED3      : 26;
        } CTRL_B;
    };

    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM   uint32_t DATARDY        : 1;
            __IM   uint32_t CLKERCSTS      : 1;
            __IM   uint32_t FSCSTS         : 1;
            __IM   uint32_t RESERVED1      : 2;
            __IOM  uint32_t CLKERINT       : 1;
            __IOM  uint32_t FSINT          : 1;
            __IM   uint32_t RESERVED2      : 25;
        } STS_B;
    };

    union
    {
        __IM uint32_t DATA;

        struct
        {
            __IM   uint32_t DATA           : 32;
        } DATA_B;
    };
} RNG_T;

/**
* @brief LCD display controller (LCD)
*/
typedef struct
{
    /** LCD control register  */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t LCDEN         : 1;
            __IOM uint32_t VSCFG         : 1;
            __IOM uint32_t DUTYCFG       : 3;
            __IOM uint32_t BIASCFG       : 2;
            __IOM uint32_t MUXSEGEN      : 1;
            __IM uint32_t RESERVED       : 24;
        } CTRL_B;
    } ;

    /** LCD Frame control register  */
    union
    {
        __IOM uint32_t FCTRL;

        struct
        {
            __IOM uint32_t HDEN          : 1;
            __IOM uint32_t SOFIEN        : 1;
            __IM  uint32_t RESERVED1     : 1;
            __IOM uint32_t UDDIEN        : 1;
            __IOM uint32_t PONCFG        : 3;
            __IOM uint32_t DEADCFG       : 3;
            __IOM uint32_t VLCDCFG       : 3;
            __IOM uint32_t BFSEL         : 3;
            __IOM uint32_t BMSEL         : 2;
            __IOM uint32_t CLKDIVSEL     : 4;
            __IOM uint32_t PRESEL        : 4;
            __IM  uint32_t RESERVED2     : 6;
        } FCTRL_B;
    } ;

    /** LCD Status Register  */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM  uint32_t LCDSTS        : 1;
            __IM  uint32_t SOFFLG        : 1;
            __IOM uint32_t UDRFLG        : 1;
            __IM  uint32_t UDDFLG        : 1;
            __IM  uint32_t RDYFLG        : 1;
            __IM  uint32_t FCTRLSFLG     : 1;
            __IM  uint32_t RESERVED      : 26;
        } STS_B;
    } ;

    /** LCD Clear the zero register  */
    union
    {
        __IOM uint32_t CLR;

        struct
        {
            __IM  uint32_t RESERVED1     : 1;
            __IM  uint32_t SOFCLR        : 1;
            __IM  uint32_t RESERVED2     : 1;
            __IOM uint32_t UDDCLR        : 1;
            __IM  uint32_t RESERVED3     : 28;
        } CLR_B;
    } ;

    __IM  uint32_t  RESERVED1;

    /** LCD Display memory  */
    __IOM uint32_t DM[16];

} LCD_T;

/**
  * @brief Firewall (FWL)
  */
typedef struct
{
    /** code segment start address register */
    union
    {
        __IOM uint32_t CSSTADD;

        struct
        {
            __IM  uint32_t RESERVED1 : 8;
            __IOM uint32_t CSSTADD   : 16;
            __IM  uint32_t RESERVED2 : 8;
        } CSSTADD_B;
    } ;

    /** code segment length register */
    union
    {
        __IOM uint32_t CSL;

        struct
        {
            __IM  uint32_t RESERVED1 : 8;
            __IOM uint32_t CSL       : 14;
            __IM  uint32_t RESERVED2 : 10;
        } CSL_B;
    } ;

    /** non-volatile data segment start address register */
    union
    {
        __IOM uint32_t NVDSSTADD;

        struct
        {
            __IM  uint32_t RESERVED1 : 8;
            __IOM uint32_t NVDSSTADD : 16;
            __IM  uint32_t RESERVED2 : 8;
        } NVDSSTADD_B;
    } ;

    /** non-volatile data segment length register */
    union
    {
        __IOM uint32_t NVDSL;

        struct
        {
            __IM  uint32_t RESERVED1 : 8;
            __IOM uint32_t NVDSL     : 14;
            __IM  uint32_t RESERVED2 : 10;
        } NVDSL_B;
    } ;

    /** volatile data segment start address register */
    union
    {
        __IOM uint32_t VDSSTADD;

        struct
        {
            __IM  uint32_t RESERVED1 : 6;
            __IOM uint32_t VDSSTADD  : 10;
            __IM  uint32_t RESERVED2 : 16;
        } VDSSTADD_B;
    } ;

    /** volatile data segment length register */
    union
    {
        __IOM uint32_t VDSL;

        struct
        {
            __IM  uint32_t RESERVED1 : 6;
            __IOM uint32_t VDSL      : 10;
            __IM  uint32_t RESERVED2 : 16;
        } VDSL_B;
    } ;

